In [3]:
import pandas as pd

In [4]:
# with loc() method we need the column and index labels

In [5]:
# with iloc() we need integer position values

In [6]:
index = ["zero","one","two","three","four","five"]
foo = ["A","B","C","A","B","C"]
bar = ["1","2","3","4","5","6"]
baz = ["x","y","z","q","w","t"]
dictionary = {"foo":foo, "bar":bar, "baz":baz}
df = pd.DataFrame(dictionary, index=index)

In [7]:
df

      foo bar baz
zero    A   1   x
one     B   2   y
two     C   3   z
three   A   4   q
four    B   5   w
five    C   6   t

## Value

In [8]:
df.loc["zero"]

foo    A
bar    1
baz    x
Name: zero, dtype: object

In [9]:
df.iloc[0]

foo    A
bar    1
baz    x
Name: zero, dtype: object

## List

In [10]:
df.loc[["zero", "two"]]

     foo bar baz
zero   A   1   x
two    C   3   z

In [11]:
df.iloc[[0, 2]]

     foo bar baz
zero   A   1   x
two    C   3   z

## Slicing

In [12]:
df.loc["zero":"two"]
# the start and the stop elements are both included

     foo bar baz
zero   A   1   x
one    B   2   y
two    C   3   z

In [13]:
df.iloc[0:2]
#the start element is included but not the stop

     foo bar baz
zero   A   1   x
one    B   2   y

# LOC()

In [14]:
df = pd.read_csv("players_20.csv")

In [15]:
df.set_index("short_name", inplace = True)

In [16]:
df = df[["long_name","age","dob","height_cm","weight_kg","nationality","club"]]

In [17]:
df.head()

,long_name,age,dob,height_cm,weight_kg,nationality,club
short_name,,,,,,,
L. Messi,Lionel Andrés Messi Cuccittini,32,1987-06-24,170,72,Argentina,FC Barcelona
Cristiano Ronaldo,Cristiano Ronaldo dos Santos Aveiro,34,1985-02-05,187,83,Portugal,Juventus
Neymar Jr,Neymar da Silva Santos Junior,27,1992-02-05,175,68,Brazil,Paris Saint-Germain
J. Oblak,Jan Oblak,26,1993-01-07,188,87,Slovenia,Atlético Madrid
E. Hazard,Eden Hazard,28,1991-01-07,175,74,Belgium,Real Madrid

#### 1. Single value

loc[row_label, column_label]

In [18]:
# get all about L.Messi
df.loc["L. Messi"]

long_name      Lionel Andrés Messi Cuccittini
age                                        32
dob                                1987-06-24
height_cm                                 170
weight_kg                                  72
nationality                         Argentina
club                             FC Barcelona
Name: L. Messi, dtype: object

In [19]:
# get the height
df.loc["L. Messi","height_cm"]

np.int64(170)

In [20]:
#get the weight
df.loc["Cristiano Ronaldo", "weight_kg"]

np.int64(83)

In [21]:
# get all rows in height_cm
df.loc[:, "height_cm"]

short_name
L. Messi             170
Cristiano Ronaldo    187
Neymar Jr            175
J. Oblak             188
E. Hazard            175
                    ...
Shao Shuai           186
Xiao Mingjie         177
Zhang Wei            186
Wang Haijian         185
Pan Ximing           182
Name: height_cm, Length: 18278, dtype: int64

In [22]:
# get all the column that correspond to the index L. Messi
df.loc["L. Messi", :]

long_name      Lionel Andrés Messi Cuccittini
age                                        32
dob                                1987-06-24
height_cm                                 170
weight_kg                                  72
nationality                         Argentina
club                             FC Barcelona
Name: L. Messi, dtype: object

#### 2. List of values

In [23]:
# get all data about L. Messi and Cristiano Ronaldo
df.loc[["L. Messi", "Cristiano Ronaldo"], :]
df.loc[["L. Messi", "Cristiano Ronaldo"]]

,long_name,age,dob,height_cm,weight_kg,nationality,club
short_name,,,,,,,
L. Messi,Lionel Andrés Messi Cuccittini,32,1987-06-24,170,72,Argentina,FC Barcelona
Cristiano Ronaldo,Cristiano Ronaldo dos Santos Aveiro,34,1985-02-05,187,83,Portugal,Juventus

In [24]:
# get the height of L. Messi and Cristiano Ronaldo
df.loc[["L. Messi", "Cristiano Ronaldo"], "height_cm"]

short_name
L. Messi             170
Cristiano Ronaldo    187
Name: height_cm, dtype: int64

In [25]:
# get the height and the weight of L. Messi and Cristiano
df.loc[["L. Messi", "Cristiano Ronaldo"], ["height_cm","weight_kg"]]

                   height_cm  weight_kg
short_name
L. Messi                 170         72
Cristiano Ronaldo        187         83

#### 3. Slicing

In [26]:
players = ["L. Messi","Cristiano Ronaldo"]
columns = ["age","dob","height_cm","weight_kg","nationality"]

In [27]:
# slice columns label
df.loc[players, "age":"club"]

,age,dob,height_cm,weight_kg,nationality,club
short_name,,,,,,
L. Messi,32,1987-06-24,170,72,Argentina,FC Barcelona
Cristiano Ronaldo,34,1985-02-05,187,83,Portugal,Juventus

In [28]:
df.index[:10]

Index(['L. Messi', 'Cristiano Ronaldo', 'Neymar Jr', 'J. Oblak', 'E. Hazard',
       'K. De Bruyne', 'M. ter Stegen', 'V. van Dijk', 'L. Modrić',
       'M. Salah'],
      dtype='object', name='short_name')

In [29]:
# slice index labels
# df.loc['L. Messi':'M. Salah', columns]
df.loc[df.index[:10], columns]

                   age         dob  height_cm  weight_kg  nationality
short_name
L. Messi            32  1987-06-24        170         72    Argentina
Cristiano Ronaldo   34  1985-02-05        187         83     Portugal
Neymar Jr           27  1992-02-05        175         68       Brazil
J. Oblak            26  1993-01-07        188         87     Slovenia
E. Hazard           28  1991-01-07        175         74      Belgium
K. De Bruyne        28  1991-06-28        181         70      Belgium
M. ter Stegen       27  1992-04-30        187         85      Germany
V. van Dijk         27  1991-07-08        193         92  Netherlands
L. Modrić           33  1985-09-09        172         66      Croatia
M. Salah            27  1992-06-15        175         71        Egypt

#### 4. Conditions

In [30]:
df["height_cm"]>180

short_name
L. Messi             False
Cristiano Ronaldo     True
Neymar Jr            False
J. Oblak              True
E. Hazard            False
                     ...
Shao Shuai            True
Xiao Mingjie         False
Zhang Wei             True
Wang Haijian          True
Pan Ximing            True
Name: height_cm, Length: 18278, dtype: bool

In [31]:
df.loc[df["height_cm"]>180, columns]

                   age         dob  height_cm  weight_kg          nationality
short_name
Cristiano Ronaldo   34  1985-02-05        187         83             Portugal
J. Oblak            26  1993-01-07        188         87             Slovenia
K. De Bruyne        28  1991-06-28        181         70              Belgium
M. ter Stegen       27  1992-04-30        187         85              Germany
V. van Dijk         27  1991-07-08        193         92          Netherlands
...                ...         ...        ...        ...                  ...
P. Martin           20  1999-01-05        188         84  Republic of Ireland
Shao Shuai          22  1997-03-10        186         79             China PR
Zhang Wei           19  2000-05-16        186         75             China PR
Wang Haijian        18  2000-08-02        185         74             China PR
Pan Ximing          26  1993-01-11        182         78             China PR

[9744 rows x 5 columns]

In [32]:
# multiple conditions
df.loc[(df["height_cm"]>180)&(df["nationality"]=="Argentina"), columns]

                age         dob  height_cm  weight_kg nationality
short_name
M. Icardi        26  1993-02-19        181         75   Argentina
G. Higuaín       31  1987-12-10        186         89   Argentina
E. Garay         32  1986-10-10        189         90   Argentina
N. Otamendi      31  1988-02-12        183         81   Argentina
G. Rulli         27  1992-05-20        189         84   Argentina
...             ...         ...        ...        ...         ...
T. Durso         20  1999-02-26        185         80   Argentina
J. Hass          21  1998-03-27        186         88   Argentina
R. Ferrario      19  2000-04-30        186         76   Argentina
L. Finochietto   22  1997-04-25        186         77   Argentina
N. Forastiero    20  1998-07-16        182         79   Argentina

[350 rows x 5 columns]

# ILOC()

#### 1. Single value

In [33]:
df.iloc[1, :]

long_name      Cristiano Ronaldo dos Santos Aveiro
age                                             34
dob                                     1985-02-05
height_cm                                      187
weight_kg                                       83
nationality                               Portugal
club                                      Juventus
Name: Cristiano Ronaldo, dtype: object

In [34]:
df.head(3)

,long_name,age,dob,height_cm,weight_kg,nationality,club
short_name,,,,,,,
L. Messi,Lionel Andrés Messi Cuccittini,32,1987-06-24,170,72,Argentina,FC Barcelona
Cristiano Ronaldo,Cristiano Ronaldo dos Santos Aveiro,34,1985-02-05,187,83,Portugal,Juventus
Neymar Jr,Neymar da Silva Santos Junior,27,1992-02-05,175,68,Brazil,Paris Saint-Germain

In [35]:
str(df.iloc[0, 3])+" cm"

'170 cm'

In [36]:
str(df.iloc[1, 4])+" kg"

'83 kg'

In [37]:
df.iloc[:,3]

short_name
L. Messi             170
Cristiano Ronaldo    187
Neymar Jr            175
J. Oblak             188
E. Hazard            175
                    ...
Shao Shuai           186
Xiao Mingjie         177
Zhang Wei            186
Wang Haijian         185
Pan Ximing           182
Name: height_cm, Length: 18278, dtype: int64

In [38]:
df.iloc[0, :]

long_name      Lionel Andrés Messi Cuccittini
age                                        32
dob                                1987-06-24
height_cm                                 170
weight_kg                                  72
nationality                         Argentina
club                             FC Barcelona
Name: L. Messi, dtype: object

#### 2. List of values

In [39]:
df.iloc[[0, 1], :]

,long_name,age,dob,height_cm,weight_kg,nationality,club
short_name,,,,,,,
L. Messi,Lionel Andrés Messi Cuccittini,32,1987-06-24,170,72,Argentina,FC Barcelona
Cristiano Ronaldo,Cristiano Ronaldo dos Santos Aveiro,34,1985-02-05,187,83,Portugal,Juventus

In [40]:
df.iloc[[0,1], 3]

short_name
L. Messi             170
Cristiano Ronaldo    187
Name: height_cm, dtype: int64

In [41]:
df.iloc[0, [3,4]]

height_cm    170
weight_kg     72
Name: L. Messi, dtype: object

In [42]:
df.iloc[[0,1], [3,4]]

                   height_cm  weight_kg
short_name
L. Messi                 170         72
Cristiano Ronaldo        187         83

#### 3. Slicing

In [43]:
df.head(3)

,long_name,age,dob,height_cm,weight_kg,nationality,club
short_name,,,,,,,
L. Messi,Lionel Andrés Messi Cuccittini,32,1987-06-24,170,72,Argentina,FC Barcelona
Cristiano Ronaldo,Cristiano Ronaldo dos Santos Aveiro,34,1985-02-05,187,83,Portugal,Juventus
Neymar Jr,Neymar da Silva Santos Junior,27,1992-02-05,175,68,Brazil,Paris Saint-Germain

In [44]:
players = [0,1]
columns = [1,2,3,4]

In [45]:
df.iloc[players, 1:]

,age,dob,height_cm,weight_kg,nationality,club
short_name,,,,,,
L. Messi,32,1987-06-24,170,72,Argentina,FC Barcelona
Cristiano Ronaldo,34,1985-02-05,187,83,Portugal,Juventus

In [46]:
df.iloc[1:11, columns]

                   age         dob  height_cm  weight_kg
short_name
Cristiano Ronaldo   34  1985-02-05        187         83
Neymar Jr           27  1992-02-05        175         68
J. Oblak            26  1993-01-07        188         87
E. Hazard           28  1991-01-07        175         74
K. De Bruyne        28  1991-06-28        181         70
M. ter Stegen       27  1992-04-30        187         85
V. van Dijk         27  1991-07-08        193         92
L. Modrić           33  1985-09-09        172         66
M. Salah            27  1992-06-15        175         71
K. Mbappé           20  1998-12-20        178         73

In [47]:
df.iloc[0, 0]

'Lionel Andrés Messi Cuccittini'

In [48]:
df.iloc[10, 0]

'Kylian Mbappé'

#### Conditions

In [49]:
list(df["height_cm"]>180)

df.iloc[list(df["height_cm"]>180), columns]

                   age         dob  height_cm  weight_kg
short_name
Cristiano Ronaldo   34  1985-02-05        187         83
J. Oblak            26  1993-01-07        188         87
K. De Bruyne        28  1991-06-28        181         70
M. ter Stegen       27  1992-04-30        187         85
V. van Dijk         27  1991-07-08        193         92
...                ...         ...        ...        ...
P. Martin           20  1999-01-05        188         84
Shao Shuai          22  1997-03-10        186         79
Zhang Wei           19  2000-05-16        186         75
Wang Haijian        18  2000-08-02        185         74
Pan Ximing          26  1993-01-11        182         78

[9744 rows x 4 columns]

In [51]:
list((df["height_cm"]>180)&(df["nationality"]=="Argentina"))
df.iloc[list((df["height_cm"]>180)&(df["nationality"]=="Argentina")), columns]

                age         dob  height_cm  weight_kg
short_name
M. Icardi        26  1993-02-19        181         75
G. Higuaín       31  1987-12-10        186         89
E. Garay         32  1986-10-10        189         90
N. Otamendi      31  1988-02-12        183         81
G. Rulli         27  1992-05-20        189         84
...             ...         ...        ...        ...
T. Durso         20  1999-02-26        185         80
J. Hass          21  1998-03-27        186         88
R. Ferrario      19  2000-04-30        186         76
L. Finochietto   22  1997-04-25        186         77
N. Forastiero    20  1998-07-16        182         79

[350 rows x 4 columns]